{
    "title": "Yahoo Finance",
    "content": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with: The chart of the day What we're watching What we're reading Economic data releases and earnings Nvidia’s much-anticipated quarterly results may have headlined the week, but the second violin of inflation metrics out Friday morning isn’t to be overlooked. The core Personal Consumption Expenditures index showed July’s prices (excluding volatile food and energy) rose 0.2% from the prior month, in line with expectations. With that metric confirmed, a very important thing has happened: The Fed’s preferred inflation gauge is back to trending below 2%, the Fed’s target and holy grail of the past two years. As our Chart of the Week illustrates, the past three months of data on an annualized basis puts the key metric at just 1.8%. Since the inflation crisis began, we’ve been here twice before, in August and December of last year. But with the labor market showing healthy cooling, there’s reason to believe that this time is different. In the near term, the results don’t change much, as Fed Chair Jerome Powell has already signaled a rate cut is coming at the conclusion of the Fed’s September meeting. But if this trend indeed solidifies — say, towards the six-month timeframe and beyond — more humdrum inflation releases will mean more flexibility for the Fed as it decides exactly how to budget and pace out its cuts. Though the latest labor market check on new unemployment insurance claims raised few alarms, both Powell and investors will appreciate the extra arrows in the quiver should a new economic beast attack from the other side of the mandate. Friday's inflation numbers also bring both 2023 and 2024’s main stories into an interesting symmetry and balance: Both the breathless AI growth story and inflation struggle have become banal. After making us wait weeks after its Magnificent peers for its report — true to its leather jacket rockstar personality — Nvidia gave us the leveling off of, say, 2000s-era U2. Selling more and more albums, but mostly rewriting the same song instead of turning heads. Not the best thing in rock ’n’ roll, but something investors can mostly live with. Ethan Wolff-Mann is a Senior Editor at Yahoo Finance, running newsletters. Follow him on X @ewolffmann. Click here for the latest economic news and indicators to help inform your investing decisions Read the latest financial and business news from Yahoo Finance Sign in to access your portfolio"
}